[
  {
    "start_time": 0.0,
    "end_time": 67.52000000000001,
    "title": "Karma Is Something That Is Manmade, Which We Carry",
    "description": "Karma is something that is manmade, which we carry from many lives. I assume that when you take up deeper practices, karmas get neutralized quicker. I have so many questions about karma today. So many people around me trying to accumulate wealth, thinking that when I have all that wealth, it's go..."
  },
  {
    "start_time": 67.52000000000001,
    "end_time": 189.76,
    "title": "Sakalam Aritorn On Trs",
    "description": "Guru Sakalam Aritorn on TRS. It was one of the most loved episodes from last year. I hope that through the course of this particular episode,  you gain a deeper understanding about karma, about your own life,  and about the practical way to live a spiritual life. Ma, welcome back to TRS! I have s..."
  },
  {
    "start_time": 189.76,
    "end_time": 316.36,
    "title": "Karma Is Something Which We Carry From Many Lives, Past",
    "description": "Karma is something which we carry from many lives, past lives. And in all our past lives, we have written so many things. In every new life, we carry more desires, more karmas,  and we write it, overwrite it, and we overwrite it. So with the multiplicity of rebirths, all of our desires which are ..."
  },
  {
    "start_time": 316.36,
    "end_time": 438.36,
    "title": "Spirituality Says, Your Present Life Is Nothing But Your Past",
    "description": "Spirituality says, your present life is nothing but your past desires driven life. What we experience as karma in this life could be an outcome of what you've done three or four lives ago as well. And we are clueless how this life is led by us. This is the state of karma of every human individual..."
  },
  {
    "start_time": 438.36,
    "end_time": 569.36,
    "title": "Secret Of Life Is Connected To These Karmas",
    "description": "You perform a bad action today and it's going to be the result tomorrow as an in you. Because we are not perfect dieticists or gods and goddesses that we don't make any mistakes. Out of ignorance, sometimes out of desires, temptations and in the name of fulfilling certain desires. We don't even k..."
  },
  {
    "start_time": 569.36,
    "end_time": 691.36,
    "title": "Good Or Bad Karma Is Karma, That You Have To Come",
    "description": "Good or bad karma is karma, that you have to come back and experience. For the human mind, bad karmas are miserable to experience. But from the point of view of the universe, which is an eyewitness to all that is going on, for them it is one and the same. So spirituality says, in fact, Swami Rama..."
  },
  {
    "start_time": 691.36,
    "end_time": 876.36,
    "title": "Way We Perform Actions In Our Life Is Also Like Blind",
    "description": "The way we perform actions in our life is also like blindfold. Even the greatest of the greatest souls have gone through terrible karma. If it's a very bad karma, very painful karma,  is a great karma, wonderful karma from this spiritual evolution of the soul. The question is when you understand ..."
  },
  {
    "start_time": 876.36,
    "end_time": 998.36,
    "title": "Damage To Your Personality, It Means",
    "description": "If there is a damage to your personality,  it means that you're clearing some karma. So you should be happy about it. There will come a stage where you are neutral to whether you're passing through good phase or bad phase. That is the phase of in astrology, Shani period. Like Shani Mahadasha. Ant..."
  },
  {
    "start_time": 998.36,
    "end_time": 1064.36,
    "title": "Happens In Everybody's Life. If You Know Human",
    "description": "It's fair to say that this happens in everyone's life, right? It happens in everybody's life. If you know human body, you have to go through. Only when you have the Guru proper guidance, then it becomes a little easier. I have a friend of mine. She's from a very affluent family. She, because of t..."
  },
  {
    "start_time": 1064.36,
    "end_time": 1187.36,
    "title": "Think Perfection Is To Just Stay Still As Life Happens",
    "description": "I think perfection is to just stay still as life happens around you. As long as it begins with prayer, I find that I'm softer towards the world and myself. There is nothing as slot like where you sit for prayer. And then you don't see a slot where you have to sit for prayers. In your whole person..."
  },
  {
    "start_time": 1187.36,
    "end_time": 1371.36,
    "title": "Sadhana: Hundreds And Thousands Of Sadhana",
    "description": "Every mantra is an energy that you are going to recreate in your body. Choosing a sadhana is also very important in life. I think we definitely began this whole phase of spiritual broadcast. And now it's a movement. It's on YouTube throughout. But I'll tell you like,  I have the luxury of meeting..."
  },
  {
    "start_time": 1371.36,
    "end_time": 1555.36,
    "title": "Mantra Is Perfect. Mantra Is Fine. Mant",
    "description": "There are unforeseen impact of certain mantras on them. Even the greatest of the mantra can also affect in a different way. All the karmas cannot be controlled. Some of them have to be suffered,  or some of the good ones have to been enjoyed. Sometimes property, money, big money,  they are good t..."
  },
  {
    "start_time": 1556.36,
    "end_time": 1678.36,
    "title": "Karma Is Expressed In A Beautiful Way In Astrology",
    "description": "\"Karma is expressed in a beautiful way in astrology,  as Raho, Ketu and Shani,\" he says. \"When they are very strong in your, you know, horoscopes,  with so many, I mean,  clauses, I am saying,  it's just a general observation. I'm not an astrologer. But when you compare your personal life to that..."
  },
  {
    "start_time": 1678.36,
    "end_time": 1802.36,
    "title": "Think Working Hard And Being Disciplined, Plus Kindness",
    "description": "I think working hard and being disciplined,  plus kindness and trying to do what's right,  like integrity. I think that's how human life should be,  and that these are the two things that should govern your choices. But it doesn't mean it will protect you from what is any way meant to happen. I r..."
  },
  {
    "start_time": 1803.36,
    "end_time": 1866.36,
    "title": "Let Every Action Be Performed As An Offering To The Divine",
    "description": "Let every action be performed as an offering to the divine. Let it be performed in the realm of surrender. They don't even talk about it every action. We perform our actions because we have to. Our actions are performed according to the desire deep within subtle and it is pushing you to do it. So..."
  },
  {
    "start_time": 1866.36,
    "end_time": 1989.36,
    "title": "Rock Bottom, How Do You Handle",
    "description": "When you are forced to do perform certain actions, might as well do it with the state that I am not to do here. The easiest, but again the toughest is surrender. Flow with it. If you try to jump over the wave, it's not possible. What you do is bend. Let the storm pass by. So, some great soul has ..."
  },
  {
    "start_time": 1989.36,
    "end_time": 2173.36,
    "title": "Yoga Says, Yoga Karma Sukhaushalam",
    "description": "Yoga says, Yoga karma sukhaushalam. Yoga is skillful action in life, of life. his whole life is a training, a learning. How to die? It's not about how to live. That's beautiful. That means how to die. How do you learn that? Yoga says, yoga karma su kushalya, skillful way,  that it doesn't affect ..."
  },
  {
    "start_time": 2173.36,
    "end_time": 2298.36,
    "title": "Deposit Good Actions And Wait For Matured,",
    "description": "When you deposit good actions and wait for matured,  what are your touch becomes gold? That you call gold face. Unseen means it's directly connected to or past actions of this life,  maybe past lives. Some actions give immediate fruits,  actions performed and immediately you get the result. There..."
  },
  {
    "start_time": 2298.36,
    "end_time": 2483.36,
    "title": "Maureen Mccormick: I Think The Nature Of Life",
    "description": "Maureen McCormick: I'm going to end this particular episode with a code by Bruce Lee. Bruce Lee said that when you're praying to God,  ask not for an easy life,  but for the strength to endure a difficult one. Maureen: I think the nature of life is not easy. No one tells you that in school or col..."
  },
  {
    "start_time": 2483.36,
    "end_time": 2607.36,
    "title": "Ma's Latest Book, The R.s. Manum",
    "description": "Karma Special on the R.S. Manumam will be back on the show very soon. Send in your feedback about what you thought about our Karma Special. We'll also link Ma's books down below. Make sure you go check out her latest book, \"The Power of One,\" which is available now on Amazon.com and the Kindle st..."
  }
]